src/Documents/ВводНачальныхОстатков/ВводНачальныхОстатков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВводНачальныхОстатков</name>
  <registerRecords>AccumulationRegister.ДоходыРасходы</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредства</registerRecords>
  <registerRecords>AccumulationRegister.Взаиморасчеты</registerRecords>
  <tabularSections>
    <name>Взаиморасчеты</name>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>Заявка</name>
      <type>
        <types>DocumentRef.ГТД</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДенежныеСредства</name>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>Казна</name>
      <type>
        <types>CatalogRef.Кассы</types>
        <types>CatalogRef.БанковскиеСчета</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ВводНачальныхОстатков/ManagerModule.bsl
Функция Проведение ( Данные ) Экспорт
	
	получитьДанныеДокумента ( Данные );
	сформироватьВзаиморасчеты ( Данные );
	сформироватьДенежныеСредства ( Данные );
	установитьФлагиЗаписи ( Данные );
	Возврат ИСТИНА;
	
КонецФункции

Процедура получитьДанныеДокумента ( Данные )
	
	с = "
	|// ~Шапка
	|выбрать 
	|	Ссылка как Ссылка, Дата как Дата, Организация как Организация
	|из
	|	Документ.ВводНачальныхОстатков
	|где
	|	Ссылка = &Ссылка
	|;
	|// ~Взаиморасчеты 
	|выбрать
	| 	Ссылка как Ссылка, ЗНАЧЕНИЕ ( ВидДвиженияНакопления.Приход ) как ВидДвижения,
	|	Ссылка.Дата как Период, Сумма как Сумма, Ссылка.Организация как Организация,
	|	Валюта как Валюта
	|из
	|	Документ.ВводНачальныхОстатков.Взаиморасчеты                                           
	|где                                        
	|	Ссылка = &Ссылка
	|;
	|// ~Денежные средства 
	|выбрать
	|	Ссылка.Дата как Период, Казна как Казна, Сумма как Сумма, Валюта как Валюта
	|из
	|	Документ.ВводНачальныхОстатков.ДенежныеСредства                                           
	|где
	|	Ссылка = &Ссылка 
	|";
	запрос = Новый Запрос ( с );
	запрос.УстановитьПараметр ( "Ссылка", Данные.Ссылка );
	результат = запрос.ВыполнитьПакет ();
	Данные.Вставить ( "Шапка", результат [ 0 ].Выгрузить () [ 0 ] );
	Данные.Вставить ( "Взаиморасчеты", результат [ 1 ].Выгрузить () );
	Данные.Вставить ( "ДенежныеСредства", результат [ 2 ].Выгрузить () );
	
КонецПроцедуры

Процедура сформироватьВзаиморасчеты ( Данные )
	
	Данные.Движения.Взаиморасчеты.Загрузить ( Данные.Взаиморасчеты );
	
КонецПроцедуры

Процедура сформироватьДенежныеСредства ( Данные )
	
	Данные.Движения.ДенежныеСредства.Загрузить ( Данные.ДенежныеСредства );
	
КонецПроцедуры

Процедура установитьФлагиЗаписи ( Данные )
	
	Данные.Движения.Взаиморасчеты.Записывать = ИСТИНА;
	Данные.Движения.ДенежныеСредства.Записывать = ИСТИНА;
	Данные.Движения.ДоходыРасходы.Записывать = ИСТИНА;
	
КонецПроцедуры
